test_reports/performance_profiling_nodeprofiler/output3.txt
This is ApacheBench, Version 2.3 <$Revision: 1874286 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/login/verify
Document Length:        12 bytes

Concurrency Level:      20
Time taken for tests:   0.140 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Keep-Alive requests:    250
Total transferred:      84250 bytes
HTML transferred:       3000 bytes
Requests per second:    1786.68 [#/sec] (mean)
Time per request:       11.194 [ms] (mean)
Time per request:       0.560 [ms] (mean, across all concurrent requests)
Transfer rate:          588.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   11   3.4     10      21
Waiting:        1   11   3.4     10      20
Total:          3   11   3.3     10      21

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     11
  75%     12
  80%     13
  90%     15
  95%     18
  98%     20
  99%     20
 100%     21 (longest request)